{
  "projects": [
    {
      "id": "linkedin-job-signal-intelligence",
      "title": "LinkedIn Hiring Signal Intelligence",
      "year": "2025",
      "description": "Automated system that finds companies actively hiring, enriches contact data, and runs personalized outreach campaigns across email and LinkedIn—generating qualified leads while you sleep.",
      "longDescription": "A complete lead generation and outreach automation built with n8n that turns LinkedIn job postings into qualified sales opportunities. The system starts by identifying companies hiring for specific roles (a strong buying signal), then automatically finds the decision-makers, validates their email addresses, and crafts AI-personalized messages based on their company's website. It manages intelligent follow-up sequences that adapt based on whether prospects are active on LinkedIn or prefer email, analyzes reply sentiment to prioritize hot leads, and sends real-time Slack notifications when someone shows interest. Everything syncs to Google Sheets for full visibility, and interested prospects automatically receive calendar booking links—turning cold outreach into warm conversations without any manual work.",
      "technologies": ["n8n",
        "airtable",
        "Linkedin scraper",
        "OpenAI API",
        "Smartlead",
        "HeyReach",
        "Google Sheets",
        "Slack"],
      "image": "/images/linkedin_outreach/linked-4.png",
      "gallery": [
        "/images/linkedin_outreach/linkedin_1.png",
        "/images/linkedin_outreach/linked--2.png",
        "/images/linkedin_outreach/linked-3.png",
        "/images/linkedin_outreach/linked-4.png"
      ],
      "features": [
        "Scrapes LinkedIn job postings to find companies with active budgets",
        "Validates and enriches contact information (75%+ email find rate)",
        "AI-generated personalized icebreakers using OpenAI (references company news/achievements)",
        "Smart channel routing (sends LinkedIn messages to active users, emails to inactive ones)",
        "Multi-stage follow-up sequences (Day 3 and Day 7 automatically)",
        "Reply sentiment analysis (flags positive responses for immediate action)",
        "Real-time Slack alerts for hot leads with interested prospects",
        "Automatic calendar link delivery to book meetings instantly",
        "Complete tracking dashboard in Google Sheets"
      ],
      "results": "Generates 20+ qualified B2B leads monthly depending on your niche and target market. Saves 25+ hours per week by eliminating manual prospecting, email hunting, and follow-up tracking."
    },
    {
      "id": "telegram-media-scraper",
      "title": "Telegram Media Scraper",
      "category": "Scraping",
      "year": "2024",
      "description": "Advanced media extraction tool for Telegram channels, enabling bulk download and organization of images, videos, and documents.",
      "longDescription": "A sophisticated Python application using the Telethon library to extract media content from Telegram channels and groups. The tool handles authentication, media filtering, and batch processing while maintaining data integrity and respecting rate limits.",
      "technologies": ["Python", "Telethon", "JSON", "AsyncIO", "SQLite"],
      "image": "/placeholder.svg",
      "gallery": [
        "/placeholder.svg?height=400&width=600",
        "/placeholder.svg?height=400&width=600",
        "/placeholder.svg?height=400&width=600"
      ],
      "features": [
        "Bulk media download",
        "Channel authentication handling",
        "Media type filtering",
        "Progress tracking and logging"
      ],
      "results": "Processed over 10,000 media files for content creators and researchers"
    },
    {
      "id": "rb2b-visitor-intelligence",
      "title": "Anonymous Website Visitor to Lead Converter",
      "year": "2024",
      "category": "Lead Generation",
      "description": "Automated system that identifies anonymous website visitors, enriches their contact information, and triggers personalized outreach campaigns to convert curious browsers into paying customers.",
      "longDescription": "A complete visitor intelligence and conversion automation that turns anonymous website traffic into qualified leads. The system integrates with an embedded script to identify companies and individuals visiting your website, enriches their contact data with verified emails and LinkedIn profiles, then automatically triggers personalized outreach sequences based on which pages they viewed and how long they spent on-site. Instead of letting 98% of your website traffic disappear anonymously, this workflow captures visitor intent in real-time, qualifies them based on their browsing behavior, and reaches out with tailored offers that speak directly to what they were researching—all while they're still warm and interested in your solution.",
      "technologies": [ "n8n", "dropcontact", "Slack","OpenAI API", "Smartlead", "Google Sheets", "Webhooks", "Javascript"],
      "image": "/images/Anonymous_visitor/rb2b4.png",
      "gallery": [
        "/images/Anonymous_visitor/rb2b1.png",
        "/images/Anonymous_visitor/rb2b2.png",
        "/images/Anonymous_visitor/rb2b3.png",
        "/images/Anonymous_visitor/rb2b4.png"
      ],
      "features": [
    "Real-time visitor identification (captures 40-60% of anonymous traffic)",
    "Enriches visitor data with email, phone, LinkedIn, and company info",
    "Tracks pages viewed and time spent to gauge buying intent",
    "AI-generated personalized outreach based on browsing behavior",
    "Automatic follow-up sequences for high-intent visitors",
    "Lead scoring based on pages visited (pricing = hot, blog = warm)",
    "Real-time Slack notifications for high-value visitors",
    "Syncs all visitor data to CRM/Google Sheets for sales team"
  ],
  "results": "Converts 15-25% of identified visitors into conversations (vs 2-3% industry average for cold outreach). Clients see 3-5x increase in qualified leads from existing website traffic with zero ad spend increase."
},
    {
  "id": "ai-sdr-agent",
  "title": "AI SDR Agent",
  "year": "2025",
  "description": "An AI-powered sales development workflow that automates prospecting, lead research, and data collection — saving hours of manual work every day.",
  "longDescription": "The AI SDR Agent helps sales teams and agencies eliminate the tedious, time-consuming parts of prospecting. Instead of manually searching for leads, checking websites, and collecting contact details, this intelligent workflow automatically discovers potential clients, analyzes their websites, and extracts key information — all in minutes. It scrapes Google to find relevant businesses, reads and understands website content using AI, and captures company names, descriptions, social links, and emails. All leads are automatically organized into Google Sheets or Airtable, ready for outreach. \n\nWith this automation, teams can focus on closing deals instead of researching them — cutting lead research time by over 80% and reducing prospecting costs by thousands each month. The workflow runs 24/7, ensuring your pipeline is always full without hiring extra SDRs.",
  "technologies": ["n8n", "OpenAI", "Python", "Playwright", "Google Sheets API", "Airtable API"],
  "image": "/images/ai_sdr/sdr_4.png",
  "gallery": [
    "/images/ai_sdr/sdr1.png",
    "/images/ai_sdr/sdr2.png",
    "/images/ai_sdr/sde_3.png",
    "/images/ai_sdr/sdr_4.png"
  ],
  "features": [
    "Automates prospect discovery across Google and business directories",
    "Analyzes website content with AI to qualify potential clients",
    "Finds and validates emails and social media profiles automatically",
    "Delivers clean, structured lead data directly into Google Sheets or Airtable",
    "Operates continuously — even while your team sleeps"
  ],
  "results": "Reduced manual prospecting time by 80%, increased qualified lead flow, and helped clients scale outreach without increasing headcount."
}

  ]
}
